/*
 * =====================================================================================
 *
 *       Filename:  2190.c
 *
 *    Description:  
 *    一所由社会各界捐款修建的希望小学马上就要竣工了！学校教室的长度为n米，宽度为3米，现在我们有2种地砖，规格分别是1米×1米，2米×2米，如果要为该教室铺设地砖，请问有几种铺设方式呢？
 *    Input
 *    输入数据首先包含一个正整数C，表示包含C组测试用例，然后是C行数据，每行包含一个正整数n(1<=n<=30)，表示教室的长度。
 *    Output
 *    对于每组测试数据，请输出铺设地砖的方案数目，每个输出占一行。
 *    Sample Input
 *    2
 *    2
 *    3
 *    Sample Output
 *    3
 *    5
 *
 *        Created:  06/13/2014 12:43:57
 *       Compiler:  gcc
 *
 *         Author:  Jackie Kuo (http://jackiekuo.com), j.kuo2012@gmail.com
 *
 * =====================================================================================
 */

#include <stdio.h>
int main(){
	int c,n,i;
	long a[30]={1,3,5};
	for(i=3;i<30;++i)
		a[i]=3*a[i-2]+2*a[i-3];
    scanf("%d",&c);
    while(c--){
		scanf("%d",&n);
		printf("%ld\n",a[n-1]);
	}
	return 0;
}

//f[n]=3*f[n-2]+2*f[n-3]
