/*
 * =====================================================================================
 *
 *       Filename:  2535.c
 *
 *    Description:  
 *    Problem Description
 *    美国大选是按各州的投票结果来确定最终的结果的，如果得到超过一半的州的支持就可以当选，而每个州的投票结果又是由该州选民投票产生的，如果某个州超过一半的选民支持希拉里，则她将赢得该州的支持。现在给出每个州的选民人数，请问希拉里至少需要赢得多少选民的支持才能当选？
 *    Input
 *    多组输入数据
 *    每组数据的第一行包括一个整数N（1<=N<=101）,表示美国的州数，N=0表示输入结束
 *    接下来一行包括N个正整数，分别表示每个州的选民数，每个州的选民数不超过100
 *    Output
 *    对于每组数据输出一行，表示希拉里至少需要赢得支持的选民数
 *    Sample Input
 *    3
 *    5 7 5
 *    0
 *    Sample Output
 *    6
 *
 *        Created:  05/11/2014 10:48:56
 *       Compiler:  gcc
 *
 *         Author:  Jackie Kuo (http://jackiekuo.com), j.kuo2012@gmail.com
 *
 * =====================================================================================
 */

#include <stdio.h>
int main(){
	int n,a[102],t,i,j;
	while(scanf("%d",&n),n){
		for(i=0;i<n;i++){
			scanf("%d",&t);
			a[i]=t/2+1;
		}
		for(i=0;i<n;i++)
			for(j=n-1;j>i;j--)
				if(a[j]<a[j-1]){
					t=a[j];
					a[j]=a[j-1];
					a[j-1]=t;
				}
		for(i=t=0;i<n/2+1;i++)
			t+=a[i];
		printf("%d\n",t);
	}
	return 0;
}
