/*
 * =====================================================================================
 *
 *       Filename:  4841.c
 *
 *    Description:  
 *    圆桌上围坐着2n个人。其中n个人是好人，另外n个人是坏人。如果从第一个人开始数数，数到第m个人，则立即处死该人；然后从被处死的人之后开始数数，再将数到的第m个人处死……依此方法不断处死围坐在圆桌上的人。试问预先应如何安排这些好人与坏人的座位，能使得在处死n个人之后，圆桌上围坐的剩余的n个人全是好人。
 *    Input
 *    多组数据，每组数据输入：好人和坏人的人数n（<=32767）、步长m（<=32767）；
 *    Output
 *    对于每一组数据，输出2n个大写字母，‘G’表示好人，‘B’表示坏人，50个字母为一行，不允许出现空白字符。相邻数据间留有一空行。
 *    Sample Input
 *    2
 *    3
 *    2
 *    4
 *    Sample Output
 *    GBBG
 *    BGGB
 *
 *        Created:  03/18/2015 21:01:43
 *       Compiler:  gcc
 *
 *         Author:  Jackie Kuo (http://jackiekuo.com), j.kuo2012@gmail.com
 *
 * =====================================================================================
 */

#include <stdio.h>
#include <string.h>
char str[70000];
int main(){
	int i,j,k,n,m;
	while(scanf("%d%d",&n,&m)!=EOF){
		memset(str,'G',2*n);
		for(i=j=k=0;k<n;i++){
			if(i==2*n)
				i=0;
			if(str[i]=='G')
				j++;
			if(j==m){
				str[i]='B';
				k++;
				j=0;
			}
		}
		for(i=0;i<2*n;++i)
			printf("%c%s",str[i],((i+1)%50==0)?"\n":"");
		printf("\n\n");
	}
	return 0;
}

/*
 * 题目没把格式说清楚
 * 不是数据间有个空行，而是每组数据后有空行
 */
